;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[AssaultRifle_PL X2WeaponTemplate]
FriendlyName="等离子步枪"
BriefSummary="高效且致命的主要武器。"
TacticalText="这种改进的突击步枪通过聚焦磁场发射电离气体射流 - 这是一种非常有效的等离子武器。"

[Shotgun_PL X2WeaponTemplate]
FriendlyName="合金加农炮"
BriefSummary="XCOM可以设计的最先进的霰弹枪版本。"
TacticalText="通过开发一种能够投射外星合金机加工碎片的发射机制，我们创造了一种极其强大的武器，对范围内的任何东西都具有毁灭性的影响。然而，在更远的距离上，精度会迅速下降。"

[Cannon_PL X2WeaponTemplate]
FriendlyName="重型等离子机枪"
BriefSummary="重型等离子机枪使用扩展的电源和冷却机制，允许比我们以前部署的任何东西都高得多的射速."
TacticalText="重型等离子机枪使用扩展的电源和冷却机制，允许比我们以前部署的任何东西都高得多的射速."

[SniperRifle_PL X2WeaponTemplate]
FriendlyName="等离子狙击步枪"
BriefSummary="XCOM可以设计的最致命的狙击步枪"
TacticalText="通过修改我们当前的动力系统以保持更大的电荷，我们开发了一种等离子狙击步枪，能够提供极其强大的射击，这将大大增加对敌方目标造成严重伤害的几率。"

[LightPlasmaRifle_PL X2WeaponTemplate]
FriendlyName="轻型等离子步枪"
BriefSummary="等离子步枪的低损伤变体."
TacticalText="这种轻型步枪的功能与我们的其他等离子武器概念相同 - 通过聚焦磁场排出的电离气体射流。"

[Pistol_PL X2WeaponTemplate]
FriendlyName="等离子手枪"
BriefSummary="XCOM可用的最强大的手枪。"
TacticalText="通过在人工产生的磁场中发射致命的电离气体，这种武器的性能远远超出了任何基于弹丸的手枪的能力。"